apns/src/test/resources/requests/with_optional_params.req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:To>http://localhost:9000/soap/NoService</wsa:To>
    <wsa:MessageID>urn:uuid:e14b229d-1a68-4855-a86d-93c09b72b964</wsa:MessageID>
    <wsa:Action>urn:pushMessage</wsa:Action>
  </soapenv:Header>
  <soapenv:Body >
    <apns:pushMessage xmlns:apns="urn:org.wso2.carbon.connector.apns">
      <apns:config>
        <apns:destination>%s</apns:destination>
        <apns:certificateFetchMethod>attachment</apns:certificateFetchMethod>
        <apns:certificateAttachmentName>%s</apns:certificateAttachmentName>
        <apns:password>%s</apns:password>
      </apns:config>
      <apns:message>
        <apns:deviceToken>%s</apns:deviceToken>
        <apns:alert>%s</apns:alert>
        <apns:badge>%s</apns:badge>
        <apns:sound>%s</apns:sound>
      </apns:message>
    </apns:pushMessage>
  </soapenv:Body>
</soapenv:Envelope>